# Introduction to Pandas

In this section, we will learn how to use pandas for data analysis. You can think of pandas as an extremely powerful version of Excel, with a lot more features. In this section of the course, you should go through the notebooks in this order:

* Series
* DataFrames
* Missing Data
* GroupBy
* Merging,Joining,and Concatenating
* Operations
* Data Input and Output

# Series

The first main data type we will learn about for pandas is the Series data type. Let's import Pandas and explore the Series object.

A Series is very similar to a NumPy array (in fact it is built on top of the NumPy array object). What differentiates the NumPy array from a Series, is that a Series can have axis labels, meaning it can be indexed by a label, instead of just a number location. It also doesn't need to hold numeric data, it can hold any arbitrary Python Object.

Let's explore this concept through some examples:

In [1]:
import numpy as np
import pandas as pd

### Creating a Series

You can convert a list,numpy array, or dictionary to a Series:

In [2]:
labels = ['a','b','c']
labelsDuplicate = ['a','a','c']
my_list = [10,20,30]
arr = np.array([10,20,30])
d = {'a':10,'b':20,'c':30}

** Using Lists**

In [3]:
pd.Series(data=my_list)

0    10
1    20
2    30
dtype: int64

In [4]:
pd.Series(data=my_list,index=labelsDuplicate)

a    10
a    20
c    30
dtype: int64

In [5]:
pd.Series(my_list,labels)

a    10
b    20
c    30
dtype: int64

** NumPy Arrays **

In [6]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int64

In [7]:
pd.Series(arr,labels)

a    10
b    20
c    30
dtype: int64

** Dictionary**

In [8]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

### Data in a Series

A pandas Series can hold a variety of object types:

pd.Series(data=labels)

In [9]:
# Even functions (although unlikely that you will use this)
pd.Series([sum,print,len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

## Using an Index

The key to using a Series is understanding its index. Pandas makes use of these index names or numbers by allowing for fast look ups of information (works like a hash table or dictionary).

Let's see some examples of how to grab information from a Series. Let us create two sereis, ser1 and ser2:

In [10]:
ser1 = pd.Series([1,2,3,4],index = ['USA', 'Germany','USSR', 'Japan'])

In [11]:
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [12]:
ser2 = pd.Series([1,2,5,4],index = ['USA', 'Germany','Italy', 'Japan'])

In [13]:
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [14]:
ser1['USA']

1

Operations are then also done based off of index:

In [15]:
ser1 + ser2

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

# DataFrames

DataFrames are the workhorse of pandas and are directly inspired by the R programming language. We can think of a DataFrame as a bunch of Series objects put together to share the same index. Let's use pandas to explore this topic!

In [16]:
from numpy.random import randn

In [17]:
np.random.seed(18052018)

In [18]:
df = pd.DataFrame(randn(5,4),index='A B C D new'.split(),columns='W X Y Z'.split())

In [19]:
'A B C D E'.split()

['A', 'B', 'C', 'D', 'E']

In [20]:
randn(5,4)

array([[ 1.65102952, -0.07753874, -1.22767616, -1.9875938 ],
       [-1.48421625,  0.13800942,  0.02364818, -0.17660049],
       [-0.62512174,  0.73838134,  0.24771635, -2.29343407],
       [-1.16139499,  0.48900478, -0.68882367, -1.43946687],
       [ 0.95914303,  0.98527949, -2.16908131, -0.4291437 ]])

In [21]:
df

            W         X         Y         Z
A   -0.250223 -0.563542  1.550688 -0.972780
B    0.250881  1.561496 -0.806814  0.895329
C    1.998788 -0.997966 -0.056742 -0.980185
D    0.931698 -0.839301  0.095641  1.571638
new  0.085332  1.581096  0.531872 -0.031923

## Selection and Indexing

Let's learn the various methods to grab data from a DataFrame

In [22]:
df['W']

A     -0.250223
B      0.250881
C      1.998788
D      0.931698
new    0.085332
Name: W, dtype: float64

In [23]:
# Pass a list of column names
df[['W','Z']]

            W         Z
A   -0.250223 -0.972780
B    0.250881  0.895329
C    1.998788 -0.980185
D    0.931698  1.571638
new  0.085332 -0.031923

In [24]:
# SQL Syntax (NOT RECOMMENDED!)
df.W

A     -0.250223
B      0.250881
C      1.998788
D      0.931698
new    0.085332
Name: W, dtype: float64

DataFrame Columns are just Series

In [25]:
type(df['W'])

pandas.core.series.Series

**Creating a new column:**

In [26]:
df['new'] = df['W'] + df['Y']

In [27]:
df

            W         X         Y         Z       new
A   -0.250223 -0.563542  1.550688 -0.972780  1.300465
B    0.250881  1.561496 -0.806814  0.895329 -0.555932
C    1.998788 -0.997966 -0.056742 -0.980185  1.942047
D    0.931698 -0.839301  0.095641  1.571638  1.027339
new  0.085332  1.581096  0.531872 -0.031923  0.617204

** Removing Columns**

In [28]:
df.drop('new',axis=1)

            W         X         Y         Z
A   -0.250223 -0.563542  1.550688 -0.972780
B    0.250881  1.561496 -0.806814  0.895329
C    1.998788 -0.997966 -0.056742 -0.980185
D    0.931698 -0.839301  0.095641  1.571638
new  0.085332  1.581096  0.531872 -0.031923

In [29]:
# Not inplace unless specified!
df

            W         X         Y         Z       new
A   -0.250223 -0.563542  1.550688 -0.972780  1.300465
B    0.250881  1.561496 -0.806814  0.895329 -0.555932
C    1.998788 -0.997966 -0.056742 -0.980185  1.942047
D    0.931698 -0.839301  0.095641  1.571638  1.027339
new  0.085332  1.581096  0.531872 -0.031923  0.617204

In [30]:
df.drop('new',axis=1,inplace=True)

In [31]:
df

            W         X         Y         Z
A   -0.250223 -0.563542  1.550688 -0.972780
B    0.250881  1.561496 -0.806814  0.895329
C    1.998788 -0.997966 -0.056742 -0.980185
D    0.931698 -0.839301  0.095641  1.571638
new  0.085332  1.581096  0.531872 -0.031923

Can also drop rows this way:

In [32]:
df.drop('new',axis=0, inplace=True)

** Selecting Rows**

In [33]:
df.loc['A']

W   -0.250223
X   -0.563542
Y    1.550688
Z   -0.972780
Name: A, dtype: float64

In [34]:
df

          W         X         Y         Z
A -0.250223 -0.563542  1.550688 -0.972780
B  0.250881  1.561496 -0.806814  0.895329
C  1.998788 -0.997966 -0.056742 -0.980185
D  0.931698 -0.839301  0.095641  1.571638

In [35]:
df.iloc[2]

W    1.998788
X   -0.997966
Y   -0.056742
Z   -0.980185
Name: C, dtype: float64

** Selecting subset of rows and columns **

In [36]:
df.loc['B','Y']

-0.8068137617467853

In [37]:
df.loc[['A','B'],['W','Y']]

          W         Y
A -0.250223  1.550688
B  0.250881 -0.806814

### Conditional Selection

An important feature of pandas is conditional selection using bracket notation, very similar to numpy:

In [38]:
df

          W         X         Y         Z
A -0.250223 -0.563542  1.550688 -0.972780
B  0.250881  1.561496 -0.806814  0.895329
C  1.998788 -0.997966 -0.056742 -0.980185
D  0.931698 -0.839301  0.095641  1.571638

In [39]:
df>0

       W      X      Y      Z
A  False  False   True  False
B   True   True  False   True
C   True  False  False  False
D   True  False   True   True

In [40]:
df[df>0]

          W         X         Y         Z
A       NaN       NaN  1.550688       NaN
B  0.250881  1.561496       NaN  0.895329
C  1.998788       NaN       NaN       NaN
D  0.931698       NaN  0.095641  1.571638

In [41]:
df[df['W']>0]

          W         X         Y         Z
B  0.250881  1.561496 -0.806814  0.895329
C  1.998788 -0.997966 -0.056742 -0.980185
D  0.931698 -0.839301  0.095641  1.571638

In [42]:
df[df['W']>0]['Y']

B   -0.806814
C   -0.056742
D    0.095641
Name: Y, dtype: float64

In [43]:
df[df['W']>0][['Y','X']]

          Y         X
B -0.806814  1.561496
C -0.056742 -0.997966
D  0.095641 -0.839301

For two conditions you can use | and & with parenthesis:

In [44]:
df[(df['W']>0) & (df['Y'] > 1)]

Empty DataFrame
Columns: [W, X, Y, Z]
Index: []

## More Index Details

Let's discuss some more features of indexing, including resetting the index or setting it something else. We'll also talk about index hierarchy!

In [45]:
df

          W         X         Y         Z
A -0.250223 -0.563542  1.550688 -0.972780
B  0.250881  1.561496 -0.806814  0.895329
C  1.998788 -0.997966 -0.056742 -0.980185
D  0.931698 -0.839301  0.095641  1.571638

In [46]:
# Reset to default 0,1...n index
df.reset_index()

  index         W         X         Y         Z
0     A -0.250223 -0.563542  1.550688 -0.972780
1     B  0.250881  1.561496 -0.806814  0.895329
2     C  1.998788 -0.997966 -0.056742 -0.980185
3     D  0.931698 -0.839301  0.095641  1.571638

In [47]:
#newind = 'CA NY WY OR CO'.split()
newind = 'CA NY WY OR'.split()

In [48]:
df['States'] = newind

In [49]:
df

          W         X         Y         Z States
A -0.250223 -0.563542  1.550688 -0.972780     CA
B  0.250881  1.561496 -0.806814  0.895329     NY
C  1.998788 -0.997966 -0.056742 -0.980185     WY
D  0.931698 -0.839301  0.095641  1.571638     OR

In [50]:
df.set_index('States')

               W         X         Y         Z
States
CA     -0.250223 -0.563542  1.550688 -0.972780
NY      0.250881  1.561496 -0.806814  0.895329
WY      1.998788 -0.997966 -0.056742 -0.980185
OR      0.931698 -0.839301  0.095641  1.571638

In [51]:
df

          W         X         Y         Z States
A -0.250223 -0.563542  1.550688 -0.972780     CA
B  0.250881  1.561496 -0.806814  0.895329     NY
C  1.998788 -0.997966 -0.056742 -0.980185     WY
D  0.931698 -0.839301  0.095641  1.571638     OR

In [52]:
df.set_index('States',inplace=True)

In [53]:
df

               W         X         Y         Z
States
CA     -0.250223 -0.563542  1.550688 -0.972780
NY      0.250881  1.561496 -0.806814  0.895329
WY      1.998788 -0.997966 -0.056742 -0.980185
OR      0.931698 -0.839301  0.095641  1.571638

# Groupby
The groupby method allows you to group rows of data together and call aggregate functions

In [54]:
# Create dataframe
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350],
       'Revenue':[100,520,30,14,43,50]}

In [55]:
df = pd.DataFrame(data)

In [56]:
df

  Company   Person  Sales  Revenue
0    GOOG      Sam    200      100
1    GOOG  Charlie    120      520
2    MSFT      Amy    340       30
3    MSFT  Vanessa    124       14
4      FB     Carl    243       43
5      FB    Sarah    350       50

** Now you can use the .groupby() method to group rows together based on a column name. For instance let's group based on of Company. This will create a DataFrameGroupBy object:**

In [57]:
df.groupby('Company')

You can save this object as a new variable:

In [58]:
by_comp = df.groupby("Company")

And then call aggregate methods off the object:

In [59]:
by_comp.mean()

         Sales  Revenue
Company
FB       296.5     46.5
GOOG     160.0    310.0
MSFT     232.0     22.0

In [60]:
df.groupby('Company').mean()

         Sales  Revenue
Company
FB       296.5     46.5
GOOG     160.0    310.0
MSFT     232.0     22.0

More examples of aggregate methods:

by_comp.std()

In [61]:
by_comp.min()

          Person  Sales  Revenue
Company
FB          Carl    243       43
GOOG     Charlie    120      100
MSFT         Amy    124       14

In [62]:
by_comp.max()

          Person  Sales  Revenue
Company
FB         Sarah    350       50
GOOG         Sam    200      520
MSFT     Vanessa    340       30

In [63]:
by_comp.count()

         Person  Sales  Revenue
Company
FB            2      2        2
GOOG          2      2        2
MSFT          2      2        2

In [64]:
by_comp.describe()

        Revenue                                                         Sales  \
          count   mean         std    min     25%    50%     75%    max count
Company
FB          2.0   46.5    4.949747   43.0   44.75   46.5   48.25   50.0   2.0
GOOG        2.0  310.0  296.984848  100.0  205.00  310.0  415.00  520.0   2.0
MSFT        2.0   22.0   11.313708   14.0   18.00   22.0   26.00   30.0   2.0


          mean         std    min     25%    50%     75%    max
Company
FB       296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG     160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT     232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [65]:
by_comp.describe().transpose()

Company                FB        GOOG        MSFT
Revenue count    2.000000    2.000000    2.000000
        mean    46.500000  310.000000   22.000000
        std      4.949747  296.984848   11.313708
        min     43.000000  100.000000   14.000000
        25%     44.750000  205.000000   18.000000
        50%     46.500000  310.000000   22.000000
        75%     48.250000  415.000000   26.000000
        max     50.000000  520.000000   30.000000
Sales   count    2.000000    2.000000    2.000000
        mean   296.500000  160.000000  232.000000
        std     75.660426   56.568542  152.735065
        min    243.000000  120.000000  124.000000
        25%    269.750000  140.000000  178.000000
        50%    296.500000  160.000000  232.000000
        75%    323.250000  180.000000  286.000000
        max    350.000000  200.000000  340.000000

In [66]:
by_comp.describe().transpose()['GOOG']

Revenue  count      2.000000
         mean     310.000000
         std      296.984848
         min      100.000000
         25%      205.000000
         50%      310.000000
         75%      415.000000
         max      520.000000
Sales    count      2.000000
         mean     160.000000
         std       56.568542
         min      120.000000
         25%      140.000000
         50%      160.000000
         75%      180.000000
         max      200.000000
Name: GOOG, dtype: float64

# Operations

There are lots of operations with pandas that will be really useful

In [67]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})

In [68]:
df.head(2)

   col1  col2 col3
0     1   444  abc
1     2   555  def

In [69]:
df.tail(2)

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

### Info on Unique Values

In [70]:
df['col2'].unique()

array([444, 555, 666])

In [71]:
df['col2'].nunique()

3

In [72]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [73]:
### Selecting Data

In [74]:
#Select from DataFrame using criteria from multiple columns
newdf = df[(df['col1']>2) & (df['col2']==444)]

In [75]:
newdf

   col1  col2 col3
3     4   444  xyz

In [76]:
### Applying Functions

In [77]:
def times2(x):
    return x*2

In [78]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [79]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [80]:
df['col1'].sum()

10

** Permanently Removing a Column**

In [82]:
del df['col1']

In [83]:
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

** Get column and index names: **

In [85]:
df.columns

Index(['col2', 'col3'], dtype='object')

In [86]:
df.index

RangeIndex(start=0, stop=4, step=1)

** Sorting and Ordering a DataFrame:**

In [88]:
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [89]:
df.sort_values(by='col2') #inplace=False by default

   col2 col3
0   444  abc
3   444  xyz
1   555  def
2   666  ghi

# Data Input and Output

This notebook is the reference code for getting input and output, pandas can read a variety of file types using its pd.read_ methods. Let's take a look at the most common data types:

## CSV

### CSV Input

In [96]:
df = pd.read_csv('gs.csv')
df

,Date,OpenPrice,HighPrice,LowPrice,ClosePrice,VolumeTraded,AdjustedPrice
0,03-01-2007,200.600006,203.320007,197.820007,200.720001,6494900.0,175.871643
1,04-01-2007,200.220001,200.669998,198.070007,198.850006,6460200.0,174.233185
2,05-01-2007,198.429993,200.000000,197.899994,199.050003,5892900.0,174.408432
3,08-01-2007,199.050003,203.949997,198.100006,203.729996,7851000.0,178.509064
4,09-01-2007,203.539993,204.899994,202.000000,204.080002,7147100.0,178.815659
5,10-01-2007,203.399994,208.440002,201.500000,208.110001,8025700.0,182.346817
6,11-01-2007,208.339996,213.169998,207.600006,211.880005,9039400.0,185.650101
7,12-01-2007,210.899994,214.220001,210.399994,213.990005,6618900.0,187.498932
8,16-01-2007,210.850006,215.130005,210.850006,213.589996,5846600.0,187.148438
9,17-01-2007,212.199997,214.089996,210.850006,213.229996,5306300.0,186.832977
10,18-01-2007,213.750000,214.809998,209.100006,209.679993,6423200.0,183.722458
11,19-01-2007,209.080002,211.440002,208.839996,210.289993,5333700.0,184.564987
12,22-01-2007,211.089996,213.250000,209.600006,212.970001,4980700.0,186.917145
13,23-01-2007,212.820007,213.419998,210.649994,212.639999,6293400.0,186.627502
14,24-01-2007,213.509995,220.169998,213.029999,220.100006,6386800.0,193.174973
15,25-01-2007,219.830002,220.509995,212.509995,213.070007,7853800.0,187.004913
16,26-01-2007,214.559998,214.899994,210.600006,213.500000,7458200.0,187.382324
17,29-01-2007,213.899994,215.080002,210.130005,211.039993,5890700.0,185.223206
18,30-01-2007,211.080002,212.309998,208.369995,208.779999,6001000.0,183.239761
19,31-01-2007,208.300003,212.750000,207.289993,212.160004,7235100.0,186.206299
20,01-02-2007,213.440002,213.899994,209.729996,212.000000,5734500.0,186.065811
21,02-02-2007,211.000000,213.899994,211.000000,213.429993,3527000.0,187.320831
22,05-02-2007,213.300003,213.720001,211.500000,212.550003,2995700.0,186.548538
23,06-02-2007,213.289993,215.860001,212.699997,214.649994,3803100.0,188.391647
24,07-02-2007,215.029999,215.850006,213.100006,213.550003,3621700.0,187.426193
25,08-02-2007,212.089996,215.210007,209.809998,213.899994,5410500.0,187.733368
26,09-02-2007,215.770004,219.259995,210.580002,213.279999,9109300.0,187.189224
27,12-02-2007,213.750000,214.000000,209.869995,211.130005,5384400.0,185.302261
28,13-02-2007,211.979996,213.300003,210.470001,212.529999,4022000.0,186.531036
29,14-02-2007,213.699997,219.100006,212.789993,217.399994,7696400.0,190.805222
...,...,...,...,...,...,...,...
2730,03-11-2017,245.369995,246.279999,243.190002,244.399994,1954600.0,243.634369
2731,06-11-2017,243.500000,244.580002,241.669998,243.490005,1744800.0,242.727219
2732,07-11-2017,243.910004,244.979996,238.839996,239.809998,2483900.0,239.058746
2733,08-11-2017,239.199997,242.320007,237.550003,241.250000,2349800.0,240.494232
2734,09-11-2017,239.509995,242.369995,237.839996,240.789993,2122400.0,240.035675
2735,10-11-2017,241.690002,243.320007,240.000000,240.149994,1845600.0,239.397675
2736,13-11-2017,237.970001,240.899994,237.160004,240.270004,1953900.0,239.517303
2737,14-11-2017,239.649994,240.880005,235.630005,237.240005,3000200.0,236.496811
2738,15-11-2017,234.970001,238.149994,233.550003,237.610001,2564100.0,236.865646
2739,16-11-2017,238.380005,240.690002,238.199997,239.369995,2304300.0,238.620117
2740,17-11-2017,238.860001,239.080002,237.119995,238.020004,2826400.0,237.274353
2741,20-11-2017,238.779999,238.779999,237.110001,238.130005,2000700.0,237.384018
2742,21-11-2017,239.410004,239.589996,237.539993,238.020004,2223800.0,237.274353
2743,22-11-2017,237.940002,238.949997,236.360001,236.429993,2177200.0,235.689331
2744,24-11-2017,237.419998,238.559998,235.550003,235.949997,1268500.0,235.210831
2745,27-11-2017,235.750000,236.880005,234.800003,235.110001,1999600.0,234.373474
2746,28-11-2017,236.089996,240.000000,234.330002,239.410004,3212900.0,238.660004
2747,29-11-2017,241.250000,244.470001,240.399994,241.360001,4500000.0,241.360001
2748,30-11-2017,244.070007,250.789993,244.000000,247.639999,6364600.0,247.639999
2749,01-12-2017,249.779999,250.679993,244.009995,248.949997,4765400.0,248.949997
2750,04-12-2017,254.889999,254.899994,250.009995,250.649994,3326100.0,250.649994
2751,05-12-2017,250.800003,251.350006,247.410004,248.330002,2526800.0,248.330002
2752,06-12-2017,246.240005,248.080002,245.130005,245.949997,2331400.0,245.949997
2753,07-12-2017,244.619995,249.479996,244.399994,248.559998,2667000.0,248.559998
2754,08-12-2017,250.500000,250.679993,247.199997,250.350006,1959100.0,250.350006
2755,11-12-2017,250.000000,251.399994,248.759995,250.130005,1494200.0,250.130005
2756,12-12-2017,250.809998,258.200012,250.690002,257.679993,3464200.0,257.679993
2757,13-12-2017,257.809998,260.500000,255.559998,255.559998,3482300.0,255.559998
2758,14-12-2017,257.130005,259.549988,255.479996,255.479996,2522000.0,255.479996
2759,15-12-2017,256.700012,258.970001,254.759995,257.170013,5280619.0,257.170013

### CSV Output

In [97]:
df.to_csv('gsTemp.csv',index=False)

## Excel
Pandas can read and write excel files, keep in mind, this only imports data. Not formulas or images, having images or macros may cause this read_excel method to crash.

### Excel Input

In [98]:
pd.read_excel('multipleStocksData.xlsx',sheet_name='gs')

,Date,OpenPrice,HighPrice,LowPrice,ClosePrice,VolumeTraded,AdjustedPrice
0,2007-01-03,200.600006,203.320007,197.820007,200.720001,6494900,175.871643
1,2007-01-04,200.220001,200.669998,198.070007,198.850006,6460200,174.233185
2,2007-01-05,198.429993,200.000000,197.899994,199.050003,5892900,174.408432
3,2007-01-08,199.050003,203.949997,198.100006,203.729996,7851000,178.509064
4,2007-01-09,203.539993,204.899994,202.000000,204.080002,7147100,178.815659
5,2007-01-10,203.399994,208.440002,201.500000,208.110001,8025700,182.346817
6,2007-01-11,208.339996,213.169998,207.600006,211.880005,9039400,185.650101
7,2007-01-12,210.899994,214.220001,210.399994,213.990005,6618900,187.498932
8,2007-01-16,210.850006,215.130005,210.850006,213.589996,5846600,187.148438
9,2007-01-17,212.199997,214.089996,210.850006,213.229996,5306300,186.832977
10,2007-01-18,213.750000,214.809998,209.100006,209.679993,6423200,183.722458
11,2007-01-19,209.080002,211.440002,208.839996,210.289993,5333700,184.564987
12,2007-01-22,211.089996,213.250000,209.600006,212.970001,4980700,186.917145
13,2007-01-23,212.820007,213.419998,210.649994,212.639999,6293400,186.627502
14,2007-01-24,213.509995,220.169998,213.029999,220.100006,6386800,193.174973
15,2007-01-25,219.830002,220.509995,212.509995,213.070007,7853800,187.004913
16,2007-01-26,214.559998,214.899994,210.600006,213.500000,7458200,187.382324
17,2007-01-29,213.899994,215.080002,210.130005,211.039993,5890700,185.223206
18,2007-01-30,211.080002,212.309998,208.369995,208.779999,6001000,183.239761
19,2007-01-31,208.300003,212.750000,207.289993,212.160004,7235100,186.206299
20,2007-02-01,213.440002,213.899994,209.729996,212.000000,5734500,186.065811
21,2007-02-02,211.000000,213.899994,211.000000,213.429993,3527000,187.320831
22,2007-02-05,213.300003,213.720001,211.500000,212.550003,2995700,186.548538
23,2007-02-06,213.289993,215.860001,212.699997,214.649994,3803100,188.391647
24,2007-02-07,215.029999,215.850006,213.100006,213.550003,3621700,187.426193
25,2007-02-08,212.089996,215.210007,209.809998,213.899994,5410500,187.733368
26,2007-02-09,215.770004,219.259995,210.580002,213.279999,9109300,187.189224
27,2007-02-12,213.750000,214.000000,209.869995,211.130005,5384400,185.302261
28,2007-02-13,211.979996,213.300003,210.470001,212.529999,4022000,186.531036
29,2007-02-14,213.699997,219.100006,212.789993,217.399994,7696400,190.805222
...,...,...,...,...,...,...,...
2730,2017-11-03,245.369995,246.279999,243.190002,244.399994,1954600,243.634369
2731,2017-11-06,243.500000,244.580002,241.669998,243.490005,1744800,242.727219
2732,2017-11-07,243.910004,244.979996,238.839996,239.809998,2483900,239.058746
2733,2017-11-08,239.199997,242.320007,237.550003,241.250000,2349800,240.494232
2734,2017-11-09,239.509995,242.369995,237.839996,240.789993,2122400,240.035675
2735,2017-11-10,241.690002,243.320007,240.000000,240.149994,1845600,239.397675
2736,2017-11-13,237.970001,240.899994,237.160004,240.270004,1953900,239.517303
2737,2017-11-14,239.649994,240.880005,235.630005,237.240005,3000200,236.496811
2738,2017-11-15,234.970001,238.149994,233.550003,237.610001,2564100,236.865646
2739,2017-11-16,238.380005,240.690002,238.199997,239.369995,2304300,238.620117
2740,2017-11-17,238.860001,239.080002,237.119995,238.020004,2826400,237.274353
2741,2017-11-20,238.779999,238.779999,237.110001,238.130005,2000700,237.384018
2742,2017-11-21,239.410004,239.589996,237.539993,238.020004,2223800,237.274353
2743,2017-11-22,237.940002,238.949997,236.360001,236.429993,2177200,235.689331
2744,2017-11-24,237.419998,238.559998,235.550003,235.949997,1268500,235.210831
2745,2017-11-27,235.750000,236.880005,234.800003,235.110001,1999600,234.373474
2746,2017-11-28,236.089996,240.000000,234.330002,239.410004,3212900,238.660004
2747,2017-11-29,241.250000,244.470001,240.399994,241.360001,4500000,241.360001
2748,2017-11-30,244.070007,250.789993,244.000000,247.639999,6364600,247.639999
2749,2017-12-01,249.779999,250.679993,244.009995,248.949997,4765400,248.949997
2750,2017-12-04,254.889999,254.899994,250.009995,250.649994,3326100,250.649994
2751,2017-12-05,250.800003,251.350006,247.410004,248.330002,2526800,248.330002
2752,2017-12-06,246.240005,248.080002,245.130005,245.949997,2331400,245.949997
2753,2017-12-07,244.619995,249.479996,244.399994,248.559998,2667000,248.559998
2754,2017-12-08,250.500000,250.679993,247.199997,250.350006,1959100,250.350006
2755,2017-12-11,250.000000,251.399994,248.759995,250.130005,1494200,250.130005
2756,2017-12-12,250.809998,258.200012,250.690002,257.679993,3464200,257.679993
2757,2017-12-13,257.809998,260.500000,255.559998,255.559998,3482300,255.559998
2758,2017-12-14,257.130005,259.549988,255.479996,255.479996,2522000,255.479996
2759,2017-12-15,256.700012,258.970001,254.759995,257.170013,5280619,257.170013

### Excel Output

In [99]:
df.to_excel('Excel_Sample.xlsx',sheet_name='apple')

## HTML

You may need to install htmllib5,lxml, and BeautifulSoup4. In your terminal/command prompt run:

    conda install lxml
    conda install html5lib
    conda install BeautifulSoup4

Then restart Jupyter Notebook.
(or use pip install if you aren't using the Anaconda Distribution)

Pandas can read table tabs off of html. For example:

### HTML Input

Pandas read_html function will read tables off of a webpage and return a list of DataFrame objects:

In [100]:
df = pd.read_html('http://www.fdic.gov/bank/individual/failed/banklist.html')

In [101]:
sampleDf = df[0]

In [102]:
df

[                                             Bank Name                City  \
 0                  Washington Federal Bank for Savings             Chicago
 1      The Farmers and Merchants State Bank of Argonia             Argonia
 2                                  Fayette County Bank          Saint Elmo
 3    Guaranty Bank, (d/b/a BestBank in Georgia & Mi...           Milwaukee
 4                                       First NBC Bank         New Orleans
 5                                        Proficio Bank  Cottonwood Heights
 6                        Seaway Bank and Trust Company             Chicago
 7                               Harvest Community Bank          Pennsville
 8                                          Allied Bank            Mulberry
 9                         The Woodbury Banking Company            Woodbury
 10                              First CornerStone Bank     King of Prussia
 11                                  Trust Company Bank             Memphis
 12                          North Milwaukee State Bank           Milwaukee
 13                              Hometown National Bank            Longview
 14                                 The Bank of Georgia      Peachtree City
 15                                        Premier Bank              Denver
 16                                      Edgebrook Bank             Chicago
 17                              Doral Bank  En Espanol            San Juan
 18                   Capitol City Bank & Trust Company             Atlanta
 19                             Highland Community Bank             Chicago
 20                    First National Bank of Crestview           Crestview
 21                                  Northern Star Bank             Mankato
 22              Frontier Bank, FSB D/B/A El Paseo Bank         Palm Desert
 23               The National Republic Bank of Chicago             Chicago
 24                                      NBRS Financial          Rising Sun
 25                               GreenChoice Bank, fsb             Chicago
 26                            Eastside Commercial Bank             Conyers
 27                              The Freedom State Bank             Freedom
 28                                         Valley Bank     Fort Lauderdale
 29                                         Valley Bank              Moline
 ..                                                 ...                 ...
 525                                  ANB Financial, NA         Bentonville
 526                                          Hume Bank                Hume
 527                             Douglass National Bank         Kansas City
 528                                  Miami Valley Bank            Lakeview
 529                                            NetBank          Alpharetta
 530                          Metropolitan Savings Bank          Pittsburgh
 531                                    Bank of Ephraim             Ephraim
 532                                      Reliance Bank        White Plains
 533              Guaranty National Bank of Tallahassee         Tallahassee
 534                                Dollar Savings Bank              Newark
 535                               Pulaski Savings Bank        Philadelphia
 536              First National Bank of Blanchardville      Blanchardville
 537                              Southern Pacific Bank            Torrance
 538                        Farmers Bank of Cheneyville         Cheneyville
 539                                      Bank of Alamo               Alamo
 540             AmTrade International Bank  En Espanol             Atlanta
 541                     Universal Federal Savings Bank             Chicago
 542                       Connecticut Bank of Commerce            Stamford
 543                                   New Century Bank     Shelby Township
 544                              Net 1st National Bank          Boca Raton
 545                                       NextBank, NA             Phoenix
 546                           Oakwood Deposit Bank Co.             Oakwood
 547                              Bank of Sierra Blanca       Sierra Blanca
 548                      Hamilton Bank, NA  En Espanol               Miami
 549                             Sinclair National Bank            Gravette
 550                                 Superior Bank, FSB            Hinsdale
 551                                Malta National Bank               Malta
 552                    First Alliance Bank & Trust Co.          Manchester
 553                  National State Bank of Metropolis          Metropolis
 554                                   Bank of Honolulu            Honolulu

      ST   CERT                Acquiring Institution        Closing Date  \
 0    IL  30570                   Royal Savings Bank   December 15, 2017
 1    KS  17719                          Conway Bank    October 13, 2017
 2    IL   1802            United Fidelity Bank, fsb        May 26, 2017
 3    WI  30003  First-Citizens Bank & Trust Company         May 5, 2017
 4    LA  58302                         Whitney Bank      April 28, 2017
 5    UT  35495                    Cache Valley Bank       March 3, 2017
 6    IL  19328                  State Bank of Texas    January 27, 2017
 7    NJ  34951  First-Citizens Bank & Trust Company    January 13, 2017
 8    AR     91                         Today's Bank  September 23, 2016
 9    GA  11297                          United Bank     August 19, 2016
 10   PA  35312  First-Citizens Bank & Trust Company         May 6, 2016
 11   TN   9956           The Bank of Fayette County      April 29, 2016
 12   WI  20364  First-Citizens Bank & Trust Company      March 11, 2016
 13   WA  35156                       Twin City Bank     October 2, 2015
 14   GA  35259                        Fidelity Bank     October 2, 2015
 15   CO  34112            United Fidelity Bank, fsb       July 10, 2015
 16   IL  57772             Republic Bank of Chicago         May 8, 2015
 17   PR  32102         Banco Popular de Puerto Rico   February 27, 2015
 18   GA  33938  First-Citizens Bank & Trust Company   February 13, 2015
 19   IL  20290            United Fidelity Bank, fsb    January 23, 2015
 20   FL  17557                       First NBC Bank    January 16, 2015
 21   MN  34983                            BankVista   December 19, 2014
 22   CA  34738    Bank of Southern California, N.A.    November 7, 2014
 23   IL    916                  State Bank of Texas    October 24, 2014
 24   MD   4862                          Howard Bank    October 17, 2014
 25   IL  28462                 Providence Bank, LLC       July 25, 2014
 26   GA  58125            Community & Southern Bank       July 18, 2014
 27   OK  12483      Alva State Bank & Trust Company       June 27, 2014
 28   FL  21793  Landmark Bank, National Association       June 20, 2014
 29   IL  10450                  Great Southern Bank       June 20, 2014
 ..   ..    ...                                  ...                 ...
 525  AR  33901       Pulaski Bank and Trust Company         May 9, 2008
 526  MO   1971                        Security Bank       March 7, 2008
 527  MO  24660       Liberty Bank and Trust Company    January 25, 2008
 528  OH  16848         The Citizens Banking Company     October 4, 2007
 529  GA  32575                           ING DIRECT  September 28, 2007
 530  PA  35353  Allegheny Valley Bank of Pittsburgh    February 2, 2007
 531  UT   1249                        Far West Bank       June 25, 2004
 532  NY  26778                     Union State Bank      March 19, 2004
 533  FL  26838              Hancock Bank of Florida      March 12, 2004
 534  NJ  31330                          No Acquirer   February 14, 2004
 535  PA  27203                       Earthstar Bank   November 14, 2003
 536  WI  11639                        The Park Bank         May 9, 2003
 537  CA  27094                            Beal Bank    February 7, 2003
 538  LA  16445            Sabine State Bank & Trust   December 17, 2002
 539  TN   9961                          No Acquirer    November 8, 2002
 540  GA  33784                          No Acquirer  September 30, 2002
 541  IL  29355               Chicago Community Bank       June 27, 2002
 542  CT  19183                   Hudson United Bank       June 26, 2002
 543  MI  34979                          No Acquirer      March 28, 2002
 544  FL  26652                       Bank Leumi USA       March 1, 2002
 545  AZ  22314                          No Acquirer    February 7, 2002
 546  OH   8966       The State Bank & Trust Company    February 1, 2002
 547  TX  22002     The Security State Bank of Pecos    January 18, 2002
 548  FL  24382     Israel Discount Bank of New York    January 11, 2002
 549  AR  34248                   Delta Trust & Bank   September 7, 2001
 550  IL  32646                Superior Federal, FSB       July 27, 2001
 551  OH   6629                    North Valley Bank         May 3, 2001
 552  NH  34264  Southern New Hampshire Bank & Trust    February 2, 2001
 553  IL   3815              Banterra Bank of Marion   December 14, 2000
 554  HI  21029                   Bank of the Orient    October 13, 2000

            Updated Date
 0     February 21, 2018
 1     February 21, 2018
 2         July 26, 2017
 3        March 22, 2018
 4      December 5, 2017
 5         March 7, 2018
 6          May 18, 2017
 7          May 18, 2017
 8    September 25, 2017
 9          June 1, 2017
 10    September 6, 2016
 11    September 6, 2016
 12       March 13, 2017
 13    February 19, 2018
 14         July 9, 2018
 15    February 20, 2018
 16        July 12, 2016
 17         May 13, 2015
 18       April 21, 2015
 19    November 15, 2017
 20    November 15, 2017
 21      January 3, 2018
 22    November 10, 2016
 23      January 6, 2016
 24    February 19, 2018
 25    December 12, 2016
 26      October 6, 2017
 27    February 21, 2018
 28    February 14, 2018
 29        June 26, 2015
 ..                  ...
 525     August 28, 2012
 526     August 28, 2012
 527    October 26, 2012
 528  September 12, 2016
 529     August 28, 2012
 530    October 27, 2010
 531       April 9, 2008
 532       April 9, 2008
 533      April 17, 2018
 534       April 9, 2008
 535     October 6, 2017
 536        June 5, 2012
 537    October 20, 2008
 538    October 20, 2004
 539      March 18, 2005
 540  September 11, 2006
 541     October 6, 2017
 542   February 14, 2012
 543      March 18, 2005
 544       April 9, 2008
 545    February 5, 2015
 546    October 25, 2012
 547    November 6, 2003
 548  September 21, 2015
 549     October 6, 2017
 550     August 19, 2014
 551   November 18, 2002
 552   February 18, 2003
 553      March 17, 2005
 554      March 17, 2005

 [555 rows x 7 columns]]

In [103]:
type(sampleDf)

pandas.core.frame.DataFrame

In [105]:
sampleDf.to_csv("sampleDf.csv")